Revit 2024 API
EnergyAnalysisWindowType.HeatTransferCoefficient Property
 The heat transfer coefficient value (U-value) of the window type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double HeatTransferCoefficient { get; }
Visual Basic
Public ReadOnly Property HeatTransferCoefficient As Double
	Get
Visual C++
public:
property double HeatTransferCoefficient {
	double get ();
}
See Also
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace